benchmark2.yaml
config:
  target: 'http://172.104.228.7:3000/graphql/'
  phases:
    - duration: 10
      arrivalRate: 1
      name: 'WARMUP 1: 1 for 10 seconds = 10'
    - duration: 18
      arrivalRate: 5
      name: 'WARMUP 2: 5 for 18 seconds = 90'
    - duration: 90
      arrivalRate: 10
      name: 'TOP: 10 * 90 seconds = 900'
    - duration: 120
      arrivalRate: 0
      name: 'COOLDOWN: 0 for 2 minutes = 0'
  variables:
    raw: true
    randomText:
      - hey
      - hoi
      - Whasup
      - naks
      - jo
      - lo
      - hoi
      - ps
      - daahhhhagg
    firstName:
      - Wijnand
      - Arnoud
      - Maurik
      - Ernst
      - Bert
      - Renate
      - Ineke
      - Annechien
      - Mans
    lastName:
      - Karsens
      - Heijns
    createMessage: |-
      mutation CreateMessage($raw: Boolean, $userId: Int!, $text: String!) {
        createMessage(raw: $raw, userId: $userId, text: $text) { 
          id 
          userId 
          user {
            firstName 
            lastName 
          } 
          text 
          createdAt 
        }
      }
    createUser: >-
      mutation CreateUser($raw: Boolean, $firstName: String!, $lastName:
      String!) {
        createUser(raw: $raw, firstName: $firstName, lastName: $lastName) { 
          firstName
          lastName 
          }
        }
    messages: |-
      {
        messages(raw: '{{ raw }}', userId:1){
          userId
          text
          user {
            firstName
            lastName
            fullName
            secret
          }
        }
      } 
scenarios:
  - name: >-
      Add user, post a message sometimes, and regularly check userlist and
      messages...
    flow:
      - loop:
          - post:
              url: /
              json:
                query: '{{ createUser }}'
                variables:
                  firstName: '{{ firstName }}'
                  lastName: '{{ lastName }}'
                  raw: '{{ raw }}'
          - think: 1
          - post:
              url: /
              json:
                query: '{{ messages }}'
          - think: 1
          - post:
              url: /
              json:
                query: '{{ createMessage }}'
                variables:
                  text: '{{ randomText }}'
                  userId: 1
                  raw: '{{ raw }}'
          - think: 1
          - post:
              url: /
              json:
                query: '{{ messages }}'
          - think: 1
      - count: 25