benchmark2.yaml
config:
  target: 'http://localhost:3000/graphql/'
  phases:
    - duration: 10
      arrivalRate: 0
      rampTo: 10
      name: 'WARMUP 1: 0-10 for 10 seconds'
    - duration: 20
      arrivalRate: 10
      rampTo: 20
      name: 'WARMUP 2: 10-20 for 20 seconds'
    - duration: 120
      arrivalRate: 20
      name: 'TOP: 20 for 2 minutes'
    - duration: 120
      arrivalRate: 0
      name: 'COOLDOWN: 0 for 2 minutes'
  variables:
    raw: 'false'
    randomText:
      - hey
      - hoi
      - Whasup
      - naks
      - jo
      - lo
      - hoi
      - ps
      - daahhhhagg
    firstName:
      - Wijnand
      - Arnoud
      - Maurik
      - Ernst
      - Bert
      - Renate
      - Ineke
      - Annechien
      - Mans
    lastName:
      - Karsens
      - Heijns
    createMessage: |-
      mutation CreateMessage($raw: Boolean, $userId: Int!, $text: String!) {
        createMessage(raw: $raw, userId: $userId, text: $text) { 
          id 
          userId 
          user {
            firstName 
            lastName 
          } 
          text 
          createdAt 
        }
      }
    createUser: >-
      mutation CreateUser($raw: Boolean, $firstName: String!, $lastName:
      String!) {
        createUser(raw: $raw, firstName: $firstName, lastName: $lastName) { 
          firstName
          lastName 
          }
        }
    messages: |-
      {
        messages(raw: '{{ raw }}', userId:1){
          userId
          text
          user {
            firstName
            lastName
            fullName
            secret
          }
        }
      } 
scenarios:
  - name: >-
      Add user, post a message sometimes, and regularly check userlist and
      messages...
    flow:
      - loop:
          - post:
              url: /
              json:
                query: '{{ createUser }}'
                variables:
                  firstName: '{{ firstName }}'
                  lastName: '{{ lastName }}'
                  raw: '{{ raw }}'
          - think: 1
          - post:
              url: /
              json:
                query: '{{ messages }}'
          - think: 1
          - post:
              url: /
              json:
                query: '{{ createMessage }}'
                variables:
                  text: '{{ randomText }}'
                  userId: 1
                  raw: '{{ raw }}'
          - think: 1
          - post:
              url: /
              json:
                query: '{{ messages }}'
          - think: 1
      - count: 50