benchmark2.yaml
config:
  target: 'http://172.104.228.7:3000/graphql/'
  phases:
    - duration: 30
      arrivalRate: 0
      rampTo: 10
      name: 'PHASE 1: 0-10 for 30 seconds'
    - duration: 60
      arrivalRate: 10
      rampTo: 20
      name: 'PHASE 2: 10-20 for 1 minute'
    - duration: 120
      arrivalRate: 20
      name: 'FINAL PHASE: 20 for 2 minutes'
  variables: 
    firstName: 
      - "Wijnand"
      - "Arnoud"
      - "Maurik"
      - "Ernst"
      - "Bert"
      - "Renate"
      - "Ineke"
      - "Annechien"
      - "Mans"
    lastName:
      - "Karsens"
      - "Heijns"
    createMessage: >-
              mutation CreateMessage($userId: Int!, $text: String!) {
              createMessage(userid: $userId, text: $text) { 
                id 
                userId 
                user {
                  firstName 
                  lastName 
                } 
                text 
                createdAt 
                }
              }
    createUser: >-
      mutation CreateUser($firstName: String!, $lastName: String!) {
        createUser(firstName: $firstName, lastName: $lastName) { 
          firstName
          lastName 
          }
        }
    messages: >-
      {
        messages(userId:1){
          userId
          text
          user {
            firstName
            lastName
            fullName
            secret
          }
        }
      } 
scenarios:
  - name: >-
      Add user, post a message sometimes, and regularly check userlist and
      messages...
    flow:
      - post:
          url: /
          json:
            query: '{{ createUser }}'
            variables:
              firstName: '{{ firstName }}'
              lastName: '{{ lastName }}'
      - think: 1
      - post:
          url: /
          json:
            query: '{{ messages }}'
      - think: 1
      - post:
          url: /
          json:
            query: '{{ createMessage }}'
            variables:
              text: Dit is een test
              userId: 1
      - think: 1
      - post:
          url: /
          json:
            query: '{{ messages }}'
      - think: 1